## Занятие 6
### Практическое задание

Понятие введено математиком Джоном Тьюки, цели такого анализа формируются следующим образом:

* максимальное «проникновение» в данные

* выявление основных структур

* выбор наиболее важных переменных

* обнаружение отклонений и аномалий

* проверка основных гипотез

* разработка начальных моделей.

#### 1. Загрузите данные из Nobel_prize.json (см. https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.json_normalize.html).

#### 2. Проведите исследовательский анализ данных flats_moscow.csv и weather.csv.
* Общая информация о данных.

* Анализ и обработка пропусков и дубликатов. Проверка типов данных.

* Выявление аномалий.

* Исследуйте корреляции между переменными.

#### 3. Проведите соединение таблиц sales и states с помощью разных типов джойнов и сравните результаты. Подсчитайте число полученных строк во всех рассмотренных слкчаях (4 типа джойнов).

In [1]:
import pandas as pd
sales = pd.read_excel('https://github.com/datagy/mediumdata/raw/master/pythonexcel.xlsx', sheet_name = 'sales')
states = pd.read_excel('https://github.com/datagy/mediumdata/raw/master/pythonexcel.xlsx', sheet_name = 'states')

In [3]:
sales.head(5)

    Product  Sales       Date           City
0   Bananas    121 2019-06-13        Atlanta
1   Bananas    236 2019-10-20        Atlanta
2    Apples    981 2019-03-12        Atlanta
3     Bread    996 2019-07-28  New York City
4  Brocolli    790 2019-10-22  New York City

In [4]:
states.head(5)

            City     State
0        Atlanta   Georgia
1  New York City  New York
2        Toronto   Ontario
3       Portland    Oregon